// #region IMPORT
import express from "express";
import Game from "./gamesClass.js";
// #endregion IMPORT

const gamesRoutes = express.Router();

//-------------------------------------------------------------------------------------------------------------------------------
//  route('/list') => get : Recupere tout les jeux |
//--------------------------------------------------------------------------------------------------------------------------------
gamesRoutes.route("/list").get(Game.get);

//-------------------------------------------------------------------------------------------------------------------------------
//  route('/new') => post : Ajout d'un nouveau jeu |
//--------------------------------------------------------------------------------------------------------------------------------
gamesRoutes.route("/new").post(Game.add);

//-------------------------------------------------------------------------------------------------------------------------------
//  route('/find/:slug') via son Slug => get : Recupere le jeu |
//--------------------------------------------------------------------------------------------------------------------------------
gamesRoutes.route("/find/:slug").get(Game.getBySlug).delete(Game.delete);

gamesRoutes.route("/find/previous-next/:slug").get(Game.getPreviousAndNext);

//-------------------------------------------------------------------------------------------------------------------------------
//  route('/module/:moduleid') get : Recupere les jeux dans le module précisé |
//--------------------------------------------------------------------------------------------------------------------------------
gamesRoutes.route("/module/:moduleid").get(Game.getGamesInModule);

gamesRoutes.route("/validation").post(Game.validation);

//-------------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------
//----------------------------------------| Les autres méthodes sont donc non allouées |-----------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------

gamesRoutes.route("/list").all((req, res) => {
    res.status(405).send();
});
gamesRoutes.route("/new").all((req, res) => {
    res.status(405).send();
});
gamesRoutes.route("/find/:slug").all((req, res) => {
    res.status(405).send();
});
gamesRoutes.route("/module/:moduleid").all((req, res) => {
    res.status(405).send();
});
gamesRoutes.route("/validation").all((req, res) => {
    res.status(405).send();
});

export default gamesRoutes;
